[
  {
    "path": "posts/2021-06-06-cascadiarconf2021/",
    "title": "CascadiaRConf::2021",
    "description": "What didn't go well, and the speech I intended to give.",
    "author": [
      {
        "name": "Nick Paterno",
        "url": "https://github.com/npaterno"
      }
    ],
    "date": "2021-06-06",
    "categories": [],
    "contents": "\r\nPreparing for and just getting by at CascadiaRConf\r\nYesterday was the Cascadia R Conference, a regional R conference for the Pacific Northwest. A few months back I made a proposal to give a talk on teaching non-stem students to code. Something I’ve done almost every term for the last two years. In the grand scheme of things that’s not really a long time, but I felt it was enough to share what I have learned. Luckily, the conference organizers felt the same and my proposal was accepted.\r\nI spent a fair amount of time preparing for what was to be my first presentation at a conference. I made my first slide deck using {Xaringan}. Practiced repeatedly and was more than ready.\r\nBeing a virtual conference, I wanted to make sure I had stable internet access. My home office is a bit far from our wireless router and I’ve had the internet drop out as well as applications like Zoom and Google Meets straight up freeze the entire computer. My solution was to present from my office at the University. This ended up being more of a problem than a solution.\r\nThe University had a planned maintenance day for a lot of networking equipment on campus. I had read the notification from IT well before the conference. I saw the main parts - which servers would be down, what software we would lose remote access to, etc. What I missed was that it also stated internet access would be down intermittently throughout the day.\r\nI watched the first half of the conference from home and moved to campus during the lunch break. Everything was going great! I was learning a lot and getting excited/nervous for my talk; I was scheduled to be the last speaker for the day. About an hour before my desktop lost internet access. After panicking for 20 or so minutes, I got my access back. Or so I thought. Things were smooth right up until I was being introduced. My internet access was cut off as the moderator was introducing me!\r\nThankfully, access was restored after a few minutes. However, at this point I was flustered and definitely thrown off. If you attended the conference you already know this. Several people told me I recovered well but I’m still disappointed with the speech I gave. What follows is the talk I had intended to give.\r\nTeaching Non-STEM Students to Code\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-06-06T20:36:40-07:00",
    "input_file": "cascadiarconf2021.knit.md"
  },
  {
    "path": "posts/welcome/",
    "title": "A small start",
    "description": {},
    "author": [
      {
        "name": "Nick Paterno",
        "url": "https://github.com/npaterno"
      }
    ],
    "date": "2021-03-29",
    "categories": [],
    "contents": "\r\nEventually, this site will be used as a personal blog and to host materials for a few classes I teach.\r\nFor now, just a small start. A place to write about my experiences as an acadamic without a PhD. Spoiler alert: imposter syndrome is real.\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-03-29T13:48:33-07:00",
    "input_file": {}
  }
]
